
[CustomEffects.A_BallistaCommander H7HeroAbility]
mName="Командующий баллистами"
mTooltip="Герой начинает игру с баллистой Альянса Света. Баллисты Альянса Света в армии этого героя получают %buff.buff.stat к %buff.buff.stat.icon атаке."
[CustomEffects.A_BallistaCommander_Buff H7BaseBuff]
mName="Командующий баллистами"
[CustomEffects.A_BlackMarketeer H7HeroAbility]
mName="Ловкий делец"
mTooltip="Герой приносит своей фракции 1 ед. случайного ресурса в день."
[CustomEffects.A_Charismatic H7HeroAbility]
mName="Дар убеждения"
mTooltip="Вероятность присоединения нейтральных армий к герою повышена на %stat1.norm. Нейтральные армии требуют на %stat2.norm ед. %ICON_GOLD золота меньше за то, чтобы присоединиться к герою."
[CustomEffects.A_Chef H7HeroAbility]
mName="Повар"
mTooltip="Живые дружественные существа восстанавливают %d.min ед. здоровья в конце каждого раунда. Живые дружественные существа получают %buff.buff.stat к %buff.buff.stat.icon боевому духу."
[CustomEffects.A_Chef_Buff H7BaseBuff]
mName="Повар"
[CustomEffects.A_GhostConjurer H7HeroAbility]
mName="Повелитель призраков"
mTooltip="Когда дружественный отряд призраков или банши убивает хотя бы одно живое существо (не нежить и не конструкта), этот отряд получает %spell.spell.buff.buff.special сущ."
[CustomEffects.A_Hotheaded H7HeroAbility]
mName="Импульсивный герой"
mTooltip="Герой начинает игру с баллистой сильванов. Баллисты сильванов в армии этого героя получают %buff1.buff.stat к %buff1.buff.stat.icon инициативе. Все дружественные существа получают %buff2.buff.stat к %buff2.buff.stat.icon инициативе до конца первого раунда."
[CustomEffects.A_Hotheaded_Buff H7BaseBuff]
mName="Импульсивный герой"
[CustomEffects.A_Hotheaded_Buff_Ballista H7BaseBuff]
mName="Импульсивный герой"
[CustomEffects.A_InsatiableThirst H7HeroAbility]
mName="Адепт неутолимой жажды"
mTooltip="Способность «Вытягивание жизни» вампиров и лордов вампиров в армии этого героя восстанавливает здоровье в размере 70% от нанесенного ими урона, вместо 50%."
[CustomEffects.A_SpiritChanneler H7HeroAbility]
mName="Духовный наставник"
mTooltip="Ежедневно герой восстанавливает %stat.norm ед. маны."
[CustomEffects.A_Vestal H7HeroAbility]
mName="Наставник весталок"
mTooltip="Герой начинает игру с послушницей Эльрата. Послушницы Эльрата в армии этого героя исцеляют все союзные отряды рядом с выбранной целью."
[SpellSpecializations.A_RegenerationAdept H7HeroAbility]
mName="Адепт восстановления"
mTooltip="Герой начинает игру с навыком «Магия земли» в ранге ученика и следующей способностью: %spell1.name. При использовании этого заклинания герой применяет соответствующий навык на один ранг выше."
[CustomEffects.A_GhostConjurer_Buff H7BaseBuff]
mName="Повелитель призраков"
[CustomEffects.A_FeralChild H7HeroAbility]
mName="Дитя природы"
mTooltip="Способности медведей и черных медведей в армии героя срабатывают в ответ на атаки ближнего и дальнего боя."
[CustomEffects.A_FireHeart_Buff H7BaseBuff]
mName="Огненное сердце"
[CustomEffects.A_FeralChild_Buff_Bear H7BaseBuff]
mName="Дитя природы"
mTooltip="«Свирепость» также срабатывает в ответ на атаки дальнего боя."
[CustomEffects.A_Cautious H7HeroAbility]
mName="Осмотрительность"
mTooltip="Все существа в армии героя автоматически обороняются, если они во время своего хода перемещались, но не атаковали."
[CustomEffects.A_FeralChild_Buff_BlackBear H7BaseBuff]
mName="Дитя природы"
mTooltip="«Свирепость» также срабатывает в ответ на атаки дальнего боя.\n«Ярость» также срабатывает в ответ на атаки ближнего боя."
[CustomEffects.A_Ingineer H7HeroAbility]
mName="Инженер"
mTooltip="Герой начинает игру с руническим камнем и баллистой гномов. Если герой теряет единицу огневой поддержки или вспомогательную единицу в бою, он получает замену по окончании боя."
[CustomEffects.A_KoboldElder H7HeroAbility]
mName="Предводитель кобольдов"
mTooltip="Кобольды-разведчики и кобольды-следопыты в армии героя получают %buff.buff.stat1 к %icon_destiny удаче и %buff.buff.stat2 к %icon_morale боевому духу."
[CustomEffects.A_KoboldElder_Buff H7BaseBuff]
mName="Предводитель кобольдов"
[CustomEffects.A_Marauder H7HeroAbility]
mName="Мародер"
mTooltip="Герой получает вдвое больше ресурсов от грабежей."
[CustomEffects.A_Pugnacious H7HeroAbility]
mName="Задира"
mTooltip="Атаки героя дополнительно наносят %stat1 урона за каждый уровень героя."
[CustomEffects.A_RuneKeeper H7HeroAbility]
mName="Хранитель рун"
mTooltip="Ауры всех дружественных рун действуют в области 5x5."
[CustomEffects.A_Shieldmaiden H7HeroAbility]
mName="Дева щита"
mTooltip="Защитники гор и воители в армии героя невосприимчивы к параличу."
[CustomEffects.A_Shieldmaiden_Buff H7BaseBuff]
mName="Дева щита"
mTooltip="Существо невосприимчиво к параличу."
[CustomEffects.A_Vikingr H7HeroAbility]
mName="Викинг"
mTooltip="Все защитники гор, воители, кобольды-разведчики, кобольды-следопыты, жрецы рун и жрецы Арката в армии героя получают новую способность – %spell1.name."
[StartingAttributeIncrease.A_EagleEye H7HeroAbility]
mName="Орлиный глаз"
mTooltip="Герой начинает игру с бонусом %stat к дальности обзора."

UCP 1.2 

[CreatureGrowthBonus.A_MedusaQueen H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Королева медуз"
mTooltip="Наместние: %buff1.buff.stat к приросту медуз и медуз-заклинательниц в землях вокруг города."

[CreatureGrowthBonus.A_MedusaQueen_Buff H7BaseBuff]
mName="Королева медуз"
mTooltip=""

[MagicSchool.A_MasterOfAir H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт воздуха"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний магии воздуха."

[MagicSchool.A_MasterOfDarkness H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт тьмы"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний магии тьмы."

[MagicSchool.A_MasterOfEarth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт земли"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний магии земли."

[MagicSchool.A_MasterOfFire H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт огня"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний магии огня."

[MagicSchool.A_MasterOfLight H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт света"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний магии света."

[MagicSchool.A_MasterOfPrime H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт изначальной магии"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний изначальной магии."

[MagicSchool.A_MasterOfWater H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт воды"
mTooltip="+1 к %icon_magic магии за каждые два уровня героя при использовании заклинаний магии воды."

[MightAbility.A_ArcheryMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мастер-лучник"
mTooltip="Герой начинает игру с навыком «Нападение» в ранге ученика и следующей способностью: %spell1.name.\nЭта способность дополнительно увеличивает основной урон существ, ведущих дальний бой, на +1."

[MightAbility.A_ArtilleryMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мастер поддержки"
mTooltip="Герой начинает игру со средством поддержки, навыком «Искусство войны» в ранге ученика и следующей способностью: %spell1.name.\nЭта способность дополнительно увеличивает здоровье средств поддержки этого героя на 100%."

[MightAbility.A_Catalyst H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Катализатор"
mTooltip="Герой начинает игру с навыком «Изначальная магия» в ранге ученика и следующей способностью: %spell1.name.\nЭта способность дополнительно добавляет герою +10 %icon_mana маны после боя."

[MightAbility.A_Enlightened H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Образованный"
mTooltip="Герой начинает игру с навыком «Просвещенность» в ранге ученика и следующей способностью: %spell1.name. \nНаместник: Все герои в землях вокруг города получают на 20% больше опыта в дополнение к прибавке от способности."

[MightAbility.A_Explorer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Исследователь"
mTooltip="Герой начинает игру с навыком «Исследование» в ранге ученика и следующей способностью: %spell1.name.\nНаместник: В землях вокруг города ваши герои перемещаются по земле на 10% быстрее в дополнение к прибавке от способности."

[MightAbility.A_Frenzy H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Берсерк"
mTooltip="Герой начинает игру с навыком «Нападение» в ранге ученика и следующей способностью: %spell1.name.\nЭта способность дополнительно увеличивает основной урон дружественных существ, ведущих ближний бой, на +1."

[MightAbility.A_Lucky H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Везунчик"
mTooltip="Герой начинает игру с навыком «Судьба» в ранге ученика и следующей способностью: %spell1.name.\nБлагодаря этой способности герой получает два временных случайных бонуса вместо одного."

[MightAbility.A_MasterBuilder H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мастер-строитель"
mTooltip="Герой начинает игру с навыком «Экономика» в ранге ученика и следующей способностью: %spell1.name. Наместник: Стоимость зданий в этом городе дополнительно снижена ещё на 10%."

[MightAbility.A_MasterOfWarcries H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Знаток боевых кличей"
mTooltip="Герой начинает игру с навыком «Боевые кличи» в ранге ученика и следующей способностью: %spell1.name.\nБоевой клич «В атаку!» дополнительно увеличивает урон, наносимый дружественными отрядами при атаках с фланга или с тыла на 25%."


[MightAbility.A_Plenipotentiary H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Искусный дипломат"
mTooltip="Герой начинает игру с навыком «Дипломатия» в ранге ученика и следующей способностью: %spell1.name.\nКогда в армии героя находятся существа разных фракций, каждый отряд дополнительно получает +10 к %icon_morale боеовму духу."

[MightAbility.A_Protector H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Заступник"
mTooltip="Герой начинает игру с навыком «Защита» в ранге ученика и следующей способностью: %spell1.name.\nНаместник: прирост основных существ в гарнизоне этого города увеличивается на 30 ед., а элитных — на 10 ед."

[MightAbility.A_Seafarer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мореплаватель"
mTooltip="Герой начинает игру с навыком «Исследование» в ранге ученика и следующей способностью: %spell1.name.\nГерой перемещается по морю на 25% быстрее."

[MightAbility.A_Tactician H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Стратег"
mTooltip="Герой начинает игру с навыком «Лидерство» в ранге ученика и следующей способностью: %spell1.name.\nБлагодаря этой способности герой может использовать первые 4 ряда клеток на поле боя, чтобы разместить войска."

[MightAbility.A_TreasureHunter H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Охотник за сокровищами"
mTooltip="Герой начинает игру с навыком «Судьба» в ранге ученика и следующей способностью: %spell1.name.\nСундуки с сокровищами, подобранные героем, дополнительно содержат на +25% больше %icon_Gold золота."

[MightAbility.A_Vitality H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Выносливость"
mTooltip="Герой начинает игру с навыком «Защита» в ранге ученика и следующей способностью: %spell1.name.\nЭта способность дополнительно увеличивает здоровье дружественных существ во время боя на +2 ед."

[SpellSpecializations.A_BlizzardMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт метели"
mTooltip="Герой начинает игру с навыком «Магия воды» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[SpellSpecializations.A_EarthquakeSpecialist_Buff_Marker H7BaseBuff]
mName="Невосприимчивость к землетрясению"
mTooltip="Метка эффекта"

[SpellSpecializations.A_FireBallSpecialist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Специалист по огненным шарам"
mTooltip="Герой начинает игру со следующим заклинанием: %spell1.name.\n%stat1  к %ICON_MAGIC магии при использовании заклинания %spell1.name в ранге ученика, %stat2 к %ICON_MAGIC магии  - в ранге эксперта и %stat3 к %ICON_MAGIC магии - в ранге мастера."

[SpellSpecializations.A_FireBoltMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт огненной стрелы"
mTooltip="Герой начинает игру с навыком «Магия огня» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[SpellSpecializations.A_HealMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт исцеления"
mTooltip="Герой начинает игру с навыком «Магия света» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[SpellSpecializations.A_LightningMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт молнии"
mTooltip="Герой начинает игру с навыком «Магия воздуха» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[SpellSpecializations.A_Mad H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Безумный"
mTooltip="Герой начинает игру со следующим заклинанием: %spell1.name и может использовать его в ранге ученика. Затраты маны на использование этого заклинания снижены наполовину."

[SpellSpecializations.A_Mad_Frenzy_Buff H7BaseBuff]
mName="Безумие"
mTooltip=""

[SpellSpecializations.A_StoneSkinMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт каменной кожи"
mTooltip="Герой начинает игру с навыком «Магия земли» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[SpellSpecializations.A_TimeMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт времени"
mTooltip="Герой начинает игру с навыком «Изначальная магия» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[SpellSpecializations.A_WeaknessMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Адепт ослабления"
mTooltip="Герой начинает игру с навыком «Магия тьмы» в ранге ученика и следующим заклинанием: %spell1.name.\nПри использовании этого заклинания герой применяет соответствующий навык на один ранг выше. %stat1 к %ICON_MAGIC магии при использовании этого заклинания в ранге мастера."

[StartingAttributeIncrease.A_AcolyteOfFortune H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Служитель фортуны"
mTooltip="Герой получает +2 к %stat.icon судьбе за каждые три уровня."

[StartingAttributeIncrease.A_Gladiator H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Гладиатор"
mTooltip="Герой получает +1 к %stat.icon силе за каждые три уровня."

[StartingAttributeIncrease.A_NaturalBornLeader H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Прирожденный лидер"
mTooltip="Герой получает +2 к %stat.icon лидерству за каждые три уровня."

[StartingAttributeIncrease.A_Painless H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Нечувствительный к боли"
mTooltip="Герой получает +1 к %ICON_DEFENSE защите за каждые три уровня."

[StartingAttributeIncrease.A_Spellweaver H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Заклинатель"
mTooltip="Герой получает +1 к %stat.icon силе магии за каждые три уровня."

[StartingAttributeIncrease.A_SpiritWalker H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Идущий с духами"
mTooltip="Герой получает +5 к максимуму %stat.icon маны за каждый уровень."

[StartingAttributeIncrease.A_Terrain_Expert H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Эксперт по местности"
mTooltip="Герой получает дополнительное очко дальности перемещения за каждые четыре уровня."

[Unique.A_Aerial_Storm_Buff H7BaseBuff]
mName="Воздушная буря"
mTooltip=""

[Unique.A_AerialStorm_Ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Воздушная буря"

[Unique.A_AerialStorm_Attack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Воздушная буря"

[Unique.A_Archaeologist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Археолог"
mTooltip="Герой начинает игру с двумя артефактами Шантири, которые нельзя обменять."

[Unique.A_Archaeologist_Major_OffHand_CursedDice H7HeroItem]
mName="Проклятая кость"
mTooltip="%buff1.buff.stat к %buff1.buff.stat.icon удаче вражеских отрядов."

[Unique.A_Archaeologist_Major_Torso_ShantiriArmour H7HeroItem]
mName="Шантирийский доспех"
mTooltip="%stat к %ICON_DEFENSE защите.\nВсе дружественные отряды получают на %buff1.buff.res1.norm меньше урона от %ICON_PRIME изначальной магии."

[Unique.A_Archmage H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Архимаг"
mTooltip="Герой начинает игру со следующей способностью: %spell1.name. Каждое заклинание, которое использует герой, дополнительно увеличивает метамагию на +1."

[Unique.A_Archmage_ArcaneCatalyst_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Архимаг"

[Unique.A_AshasWill H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Воля Асхи"
mTooltip="Эффективность навыка некромантии героя дополнительно увеличена на +%buff.buff.stat.norm."

[Unique.A_AshasWill_Buff H7BaseBuff]
mName="Воля Асхи"
mTooltip="Некромантия дполнительно поднимает %stat.norm% существ."

[Unique.A_CelestialGuard H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Небесный страж"
mTooltip="+%buff.buff.stat1.norm %buff.buff.stat1.icon скорости и +%buff.buff.stat2.norm %buff.buff.stat2.icon защиты для всех серафимов и небесных воинов в армии героя."

[Unique.A_CelestialGuard_Buff H7BaseBuff]
mName="Небесный страж"
mTooltip="%stat1.norm %stat1.icon скорости и %stat2.norm %stat2.icon защиты. "

[Unique.A_Curse H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Проклятье"
mTooltip="Наместник: Все вражеские герои в землях вокруг этого города становтся проклятыми. В течение первых 3 ходов каждого боя, проходящего в этих землях, до трёх случайных отрядов (за исключением нежити и конструктов) в армии вражеского героя будут наносить минимальный урон."

[Unique.A_Curse_Debuff H7BaseBuff]
mName="Проклятье"
mTooltip="Существо наносит минимальный урон. Длительность (ходов): %durnow."

[Unique.A_Curse_HeroBuff H7BaseBuff]
mName="Проклятый"
mTooltip="В течение первых 3 ходов каждого боя, проходящего в этих землях, до трёх случайных отрядов (за исключением нежити и конструктов) в армии героя будут наносить минимальный урон."

[Unique.A_Curse_Spell H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Проклятье"
mTooltip="Выбранное вражеское существо (за исключением нежити и конструктов) наносит минимальный урон. Длительность (ходов): %buff.buff.durini."

[Unique.A_DaughterOfEarth H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Дочь земли"
mTooltip="Герой начинает игру со следующим заклинанием: %spell1.name. В начале каждой битвы это заклинание будет накладываться на все дружественные отряды ближнего боя."

[Unique.A_DaughterOfSky H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Daughter of Sky"
mTooltip="Герой начинает игру со следующим заклинанием: %spell1.name. В начале каждой битвы это заклинание будет накладываться на все дружественные отряды, ведущие дальний бой."

[Unique.A_Dispeller H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Рассеивающий чары"
mTooltip="Герой начинает игру со следующим заклинанием: %spell1.name. Это заклинание может использоваться в области размером 4x4."

[Unique.A_DreamWalker H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Сноходец"
mTooltip="Герой начинает игру с ловцом снов. Ловец снов имеет максимальный уровень."

[Unique.A_DruidTraveller H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Друид-путешественник"
mTooltip="В каждом бою все друиды и друиды-старейшины в армии героя получают %buff1.buff.stat1.norm %buff1.buff.stat1.icon инициативы и новую способность - %spell2.name."

[Unique.A_DruidTraveller_Buff H7BaseBuff]
mName="Друид-путешественник"
mTooltip=""

[Unique.A_EconomicalProsperity H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Экономическое процветание"
mTooltip="Наместник: Цены на покупку и продажу артефактов в этом городе Лиги теней на %buff1.buff.stat2 лучше."

[Unique.A_EconomicalProsperity_Buff H7BaseBuff]
mName="Экономическое процветание"
mTooltip=""

[Unique.A_EternalLife H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Вечная жизнь"
mTooltip="После того, как любой дружественный отряд погибает в бою, 10% существ от его изначальной численности возвращается к жизни. Каждый отряд можно воскресить только один раз. "

[Unique.A_EternalLife_Buff H7BaseBuff]
mName="Вечная жизнь"
mTooltip="После того, как любой дружественный отряд погибает в бою, 10% существ от его изначальной численности возвращается к жизни."

[Unique.A_EternalShadow H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Вечная тень"
mTooltip="Все существа в армии героя становятся невосприимчивы к магии света."

[Unique.A_Fanaticism H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Фанатизм"
mTooltip="Атаки всех существ в армии героя, ведущих дальний бой, снимают случайный положительный эффект с цели."

[Unique.A_Fanaticism_Ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Фанатизм"
mTooltip="Атаки дальнего боя этого существа снимают снимают случайный положительный эффект с цели."

[Unique.A_Fanaticism_Buff H7BaseBuff]
mName="Фанатизм"
mTooltip=""

[Unique.A_FatherOfGolems H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Отец големов"
mTooltip="Способности аренитовых големов %spell1.name и %spell2.name в армии героя не имеют негативных эффектов."

[Unique.A_FatherOfGolems_Buff H7BaseBuff]
mName="Отец големов"
mTooltip="Способности %spell1.name и %spell2.name не имеют негативных эффектов."

[Unique.A_Firestorm_Buff H7BaseBuff]
mName="Огненная буря"
mTooltip=""

[Unique.A_FireStorm_Master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мастер огненной бури"
mTooltip="С вероятностью 25% все вражеские существа могут получить %buff1.buff.d.min ед. урона от %buff1.buff.d.icon магии огня в начале каждого раунда боя."

[Unique.A_GuardianOfJustice H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Защитник справедливости"
mTooltip="У всех вражеских существ 0 %icon_luck удачи."

[Unique.A_GuardianOfJustice_Buff H7BaseBuff]
mName="Защитник справедливости"
mTooltip="%icon_luck Удача этого существа становится равна 0."

[Unique.A_ImperialPresence H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Имперское присутствие"
mTooltip="Все дружественные существа получают +%buff1.buff.buff.buff.stat.norm %buff1.buff.buff.buff.stat.icon инициативы до конца своего следующего хода всякий раз, когда вражеское существо погибает."

[Unique.A_ImperialPresence_Buff H7BaseBuff]
mName="Имперское присутствие"
mTooltip="+%stat.norm %stat.icon инициативы до конца следующего хода существа."

[Unique.A_ImperialPresence_EnemyMarker_Buff H7BaseBuff]
mName="Имперское присутствие"

[Unique.A_InfiniteFreedom H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Бесконечная свобода"
mTooltip="Все дружественные существа в армии героя получают +%buff1.buff.stat1.norm %buff1.buff.stat1.icon скорости, если по соседству с ними нет дружественных отрядов."

[Unique.A_InfiniteFreedom_Buff_Increase H7BaseBuff]
mName="Бесконечная свобода"
mTooltip=""

[Unique.A_Meditation H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Медитация"
mTooltip="Герой может полностью восстановить запас %icon_mana маны. Можно использовать один раз в неделю."

[Unique.A_Meditation_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Медитация"
mTooltip="Герой может восполнить свой запас %icon_mana маны. Можно использовать один раз в неделю."

[Unique.A_Meditation_Buff H7BaseBuff]
mName="Медитация"

[Unique.A_Obliteration H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Уничтожение"
mTooltip="Все существа в армии героя получают +%buff1.buff.stat.norm %icon_movement скорости во время своего перового хода в бою."

[Unique.A_Obliteration_Buff H7BaseBuff]
mName="Уничтожение"
mTooltip="Существо получает +%stat.norm %icon_movement скорости во время своего перового хода."

[Unique.A_OpenMinded H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Открытый"
mTooltip="Ежедневно герой получает бонус школы магии в соответствии с текущим днём. Способность начинает действовать с начала новой недели, если герой нанимается в середине текущей."

[Unique.A_OpenMinded_Buff_1 H7BaseBuff]
mName="Ашда"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_prime изначальной магии."

[Unique.A_OpenMinded_Buff_2 H7BaseBuff]
mName="Малда"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_dark магии тьмы."

[Unique.A_OpenMinded_Buff_3 H7BaseBuff]
mName="Элда"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_light магии света."

[Unique.A_OpenMinded_Buff_4 H7BaseBuff]
mName="Арда"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_fire магии огня."

[Unique.A_OpenMinded_Buff_5 H7BaseBuff]
mName="Силада"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_earth магии земли."

[Unique.A_OpenMinded_Buff_6 H7BaseBuff]
mName="Шалда"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_water магии воды."

[Unique.A_OpenMinded_Buff_7 H7BaseBuff]
mName="Илда"
mTooltip="Герой получает %stat %stat.icon к магии при использовании заклинаний %icon_air магии воздуха."

[Unique.A_Perfectionist H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Перфекционист"
mTooltip="Всякий раз, когда герой использует заклинание магии света, все дружественные отряды наносят максимальный урон до конца текущего хода."

[Unique.A_Perfectionist_Buff H7BaseBuff]
mName="Перфекционист"
mTooltip="Существо наносит максимальный урон до конца текущего хода."

[Unique.A_Plunderer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Грабитель"
mTooltip="Всякий раз, когда герой побеждает в бою, он получает один случайный редкий ресурс."

[Unique.A_PositionWar H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Позиционная война"
mTooltip="В начале каждой битвы все отряды в армии героя, ведущие ближний бой, дополнительно получают %buff1.buff.stat.norm %icon_defense защиты до тех пор, пока не сдвинутся с места."

[Unique.A_PositionWar_Buff H7BaseBuff]
mName="Позиционная война"
mTooltip="Существо получает %stat.norm %stat.icon защиты до тех пор, пока не сдвинется с места."

[Unique.A_ProtectorOfTheWeak H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Защитник слабых"
mTooltip="Наместник: Все дружественные герои в землях вокруг этого города получают %buff1.buff.stat к %buff1.buff.stat.icon защите."

[Unique.A_ProtectorOfTheWeak_Buff H7BaseBuff]
mName="Защитник слабых"
mTooltip="%stat к %stat.icon защите в окрестных землях"

[Unique.A_PrudentLeader H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Благоразумный лидер"
mTooltip="Все существа в армии героя получают +%buff1.buff.buff.buff.stat.norm %buff1.buff.buff.buff.stat.icon атаки на свой следующий ход, если они не атаковали в текущем раунде боя."

[Unique.A_PrudentLeader_Buff H7BaseBuff]
mName="Благоразумный лидер"
mTooltip="Существо получает %stat.norm %stat.icon атаки до конца своего следующего хода."

[Unique.A_PrudentLeader_Buff_Marker H7BaseBuff]
mName="Благоразумный лидер"

[Unique.A_Revengeful H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мстительный"
mTooltip="Первое вражеское существо, атакующее дружественный отряд в каждом раунде боя, получает -%buff1.buff.buff1.buff.stat.norm %buff1.buff.buff1.buff.stat.icon защиты на %buff1.buff.buff1.buff.durini хода(ов)."

[Unique.A_Revengeful_Buff H7BaseBuff]
mName="Мстительный"
mTooltip="Существо получает %stat %stat.icon защиты. Длительность (ходов): %durnow."

[Unique.A_Revengeful_Buff_Prepare H7BaseBuff]
mName="Мстительный"
mTooltip=""

[Unique.A_Reviver H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Воскреситель"
mTooltip="Герой получает заклинание %spell для использования во время боя. Эффект этого заклинания улучшается благодаря навыку "Магия тьмы."

[Unique.A_Reviver_AnimateDead_Spell H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Поднятие мертвых"
mTooltip="Возвращает к жизни павших мертвых существ в количестве, соответствующем %d.min ед. здоровья."

[Unique.A_ShadowCommander H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Командир теней"
mTooltip="Герой начинает игру с теневым наблюдателем. Теневой наблюдатель в армии этого героя получает %buff.buff.stat1 %buff.buff.stat1.icon атаки и %buff.buff.stat2 %buff.buff.stat2.icon инициативы."

[Unique.A_ShadowCommander_Buff H7BaseBuff]
mName="Командир теней"
mTooltip=""

[Unique.A_SonOfTheWolf H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Сын волка"
mTooltip="Нет штрафа после использования способности %spell1.name на всех существ в армии героя."

[Unique.A_SpyMaster H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мастер шпионов"
mTooltip="Лазутчики могут устроить две дополнительные диверсии или разграбить две дополнительные цели."

[Unique.A_Spymaster_Player_Buff H7BaseBuff]
mName="Spymaster"
mTooltip="Лазутчики могут устроить две дополнительные диверсии или разграбить две дополнительные цели."

[Unique.A_SylvanPriestess_Spec H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Лесная жрица"
mTooltip="Герой начинает игру с заклинанием %spell.name. Это заклинание используется с %stat %stat.icon магии. Связи с весталками также дают герою послушницу Эльрата."

[Unique.A_Untouchable H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Неприкасаемый"
mTooltip="Всякий раз, когда дружественные существа находятся под покровом Малассы, они могут получать выгоду от следующей способности: %spell.name."

[Unique.A_WisdomOfAncestors H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Мудрость предков"
mTooltip="Существа в армии героя не теряют очки кровавой ярости при ожидании или обороне."

[CustomEffects.A_FireHeart H7HeroAbility]
mName="Огненное сердце"
mTooltip="Применив в бою заклинание магии огня, герой получает дополнительный ход в текущем раунде. Во время дополнительного хода герой получит %buff1.buff.stat2 к %ICON_MAGIC магии."

UCP 1.3

[Unique.A_LightGuard H7HeroAbility]
mName="Страж света"
mTooltip="Герой начинает игру со следующим заклинанием: %spell1.name. Это заклинание накладывается на всех дружественных малых существ в начале каждого боя."

[SpellSpecializations.A_EarthquakeSpecialist H7HeroAbility]
mName="Специалист по землетрясениям"
mTooltip="Дружественные существа невосприимчивы к заклинанию %spell1.name."

[Unique.A_LustForBlood H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Жажда крови"
mTooltip="Все существа (кроме тех, кто имеет способность %spell3.name и конструктов) в армии героя могут вытягивать жизнь из живых вражеских существ. Их удары восстанавливают здоровье в размере, равном 3% нанесенного урона, а также воскрешают павших существ."

[Unique.A_Glamour H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Очарование"
mTooltip="Герой приносит %special ед. %special.icon звездного серебра в день до тех пор, пока находится под следующим эффектом: %spell1.name. Этот эффект также даёт герою +3 к %icon_attack атаке."

[Unique.A_Glamour_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Очарование"
mTooltip="Герой приносит %special ед. %special.icon звездного серебра в день до тех пор, пока находится под следующим эффектом: %spell1.name. Этот эффект также даёт герою +3 к %icon_attack атаке."

[Unique.A_AerialStorm H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Воздушная буря"
mTooltip="Заклинания призыва элементалей, используемые этим героем, всегда призывают элементалей воздуха.\nВсе атаки элементалей воздуха в армии героя также поражают всех вражеских существ, находящихся по соседству с выбранным отрядом."